app/views/users/_form.html.erb

        <div class="controls">
            <%= form.select :almacene_id, Almacene.where(deleted: nil).collect {|p| [p.nombre,p.id]}   ,{},{class: 'form-control'} %>
---
SELECT `almacenes`.* FROM `almacenes` WHERE `almacenes`.`deleted` IS NULL