app/controllers/categoria_controller.rb

  def index
    @categoria = Categoria.all
---
SELECT `categoria`.* FROM `categoria`

  def create
    @Categoria = Categoria.new(Categoria_params)

    respond_to do |format|
      if @Categoria.save
---
INSERT INTO `categoria` (`user_id`, `icon_id`, `nombre`, `tipo`, `movimiento`, `descripcion`, `borrado`, `created_at`, `updated_at`) VALUES (1, 1, 'Casa', 'Transacciones', 'Entrada', '', '2018-07-28 14:25:00', '2018-07-28 14:26:30', '2018-07-28 14:26:30')

  def update
    respond_to do |format|
      if @Categoria.update(Categoria_params)
---
UPDATE `categoria` SET `nombre` = 'Demo Modificado 3', `updated_at` = '2018-05-21 16:02:09' WHERE `categoria`.`id` = 4

  def destroy
    @Categoria.destroy
---
DELETE FROM `categoria` WHERE `categoria`.`id` = 2

    def set_Categoria
      @Categoria = Categoria.find(params[:id])
---
SELECT  `categoria`.* FROM `categoria` WHERE `categoria`.`id` = 4 LIMIT 1