app/controllers/clientes_controller.rb

SELECT `clientes`.* FROM `clientes`
---
  def index
    @clientes = Cliente.all

INSERT INTO `clientes` (`user_id`, `nombre`, `telefono`, `estado`, `observaciones`, `borrado`, `created_at`, `updated_at`) VALUES (1, 'Vergara y Asociados', '', '', '', '2018-07-28 14:27:00', '2018-07-28 14:27:18', '2018-07-28 14:27:18')
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save

SELECT  `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 1 LIMIT 1
---
    def set_cliente
      @cliente = Cliente.find(params[:id])