app/controllers/transacciones_controller.rb

  def index
    @transacciones = Transaccione.all
---
SELECT `transacciones`.* FROM `transacciones`