app/controllers/users_controller.rb

INSERT INTO `users` (`nombre`, `password_salt`, `password_hash`, `created_at`, `updated_at`, `email`, `encrypted_password`, `rol`, `almacene_id`) VALUES ('demo', '$2a$10$ctmgNHS/ssslTogwUTL2l.', '$2a$10$ctmgNHS/ssslTogwUTL2l.bxdhMLQizjlXpCsS342fr4N0.9D/MXG', '2018-05-25 15:21:38', '2018-05-25 15:21:38', 'c@c.com', '$2a$11$oEPZPNYBsESim0aHTpz0i.iIlWBfZ6.87tPq/Fx1zim9WWP3yxHeC', 'Administrador', 1)
---
  def create
    parausuarios = user_params
    if user_params[:contra2] != ''
      parausuarios[:password] = user_params[:contra2]
    end

    @user = User.new(parausuarios)
    respond_to do |format|
      if @user.save

UPDATE `users` SET `nombre` = 'cristiamherrera', `rol` = 'Administrador', `almacene_id` = 1, `encrypted_password` = '$2a$11$E5FkQ4vh/T6pfmBLA9nQUOuS2iyb/fgMXik1NEIGbdVMkyAGvL1LC', `password_salt` = '$2a$10$zhO6Fqo8rCtFkxk5RfRroe', `password_hash` = '$2a$10$zhO6Fqo8rCtFkxk5RfRroeMhT4vBJN8g02qVmLphVAZgSgJq/5RDK', `updated_at` = '2018-05-25 15:22:04' WHERE `users`.`id` = 1
---
  def update
    respond_to do |format|
      # byebug
      parausuarios = user_params
      if user_params[:contra2] != ''
        parausuarios[:password] = user_params[:contra2]
      end
      if @user.update(parausuarios)